[
  {
    "id": 1,
    "name": "Shally Ify",
    "rating": 5,
    "text": "Because I checked for reviews while looking for a hospital to register for antenatal before settling for base specialist through other people's reviews I have to come back and drop mine after having my baby there. The hospitality and professionalism at base specialist is top notch. No delay with attending to patients. God bless the very experienced doctors and nurses for making delivery a wonderful experience for me.",
    "avatar": null
  },
  {
    "id": 2,
    "name": "Joy Omole",
    "rating": 5,
    "text": "Rating a 5 star because my family started using this facility several months ago and the service has been nothing short of excellent. I also had my second baby here 2 weeks ago. Throughout the antenatal process up until delivery, the doctors and nurses were very professional and empathetic. I can't count the number of times I heard the word \"sorry\" while being administered drugs, injections etc. None of my complains was treated with levity. The doctor always ensured he proferred timely solutions. The delivery process was a contrast to my first baby's delivery experience who I had in a different hospital. I felt listened to and heard at Base specialist hospital. The hygiene is also top notch and the staff are very welcoming. I definitely recommend 💯.",
    "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjW4qvbkiMluyUrI-l1PkC7psANCVHOdxRzwZUFj24rJlQk98OBU=w144-h144-p-rp-mo-br100"
  },
  {
    "id": 3,
    "name": "Davidson Tarhe",
    "rating": 1,
    "text": "My name is Mr Dafe OBATARHE, Base specialist hospital is one of the best hospital, they have the best doctors and experienced nurses, I recommend Base specialist hospital for anyone with health issues living around Ketu and it's environ....",
    "avatar": null
  },
  {
    "id": 4,
    "name": "Halleluyah Olaboyin",
    "rating": 5,
    "text": "Base Specialist is great. They have the best doctors, especially Dr. Adeyemi. They're professional in their services. They'll tell you all you need to know without asking. Excellent 👌👍",
    "avatar": null
  },
  {
    "id": 5,
    "name": "Abd-Rahman Badru",
    "rating": 5,
    "text": "The session with the health workers, i.e. Attendant Nurse, Doctor was seamless, no delay at all. What you see in the google pictures is the same with reality, easy to locate with both internal and external environment very tidy; I recommend this hospital to everyone living near and beyond.",
    "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjX-f9knIZIa8HDjoy6dBKIYBTVZG-FZK6uksmzh8GcWMODYrTRy=w144-h144-p-rp-mo-br100"
  },
  {
    "id": 6,
    "name": "Eniola Alufa",
    "rating": 5,
    "text": "The environment is serene, The doctors and nurses are very caring and professional. Their service is top notch.",
    "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjWCHUubWKZWRMxoJyzyC-YzTaI5WLaw5p_6_Uzqw2NBfM9YzSX8Vw=w144-h144-p-rp-mo-br100"
  },
  {
    "id": 7,
    "name": "Chinonso Obasi",
    "rating": 5,
    "text": "The hospital is neat with qualified and well mannered doctors and nurses.",
    "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjXQ766LAVTEkaGORMg9TlhqhRcB3XtncW9MbFnWJWwqDzGuFH8L=w144-h144-p-rp-mo-ba3-br100"
  },
  {
    "id": 8,
    "name": "Emmanuel Nwughala",
    "rating": 5,
    "text": "Top notch services and quality caregivers",
    "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjVLPXpGTJQWtSSrFFoJzhinq27OQ9kJg7APYEqrscZxEENnxzEq=w144-h144-p-rp-mo-br100"
  }
]